{
    "orderID": "4762739",
    "subject": {
      "address": "7180 207 HWY Halifax NS B0J2L0",
      "subject_city_province_zip": "West Chezzetcook, NS B0J2L0",
      "effective_date": "Apr/17/2025",
      "municipality_district": "Halifax Regional Municipality - West Chezzetcook",
      "site_dimensions": "See Schedule A and or Plot Map",
      "lot_size_sf": "72745+/-SqFt",
      "units_sq_ft": "SqFt",
      "year_built": "2011",
      "structure_type": "Detached",
      "roofing": "Asphalt Shingle",
      "effective_age": "10",
      "style": "1.5 Storey",
      "construction": "Log",
      "remaining_economic_life": "50",
      "windows": "Wood",
      "basement": "Full/Finished",
      "exterior_finish": "Log",
      "basement_area": "1060",
      "foundation_walls": "Poured Concrete",
      "flooring": "Carpet",
      "plumbing_lines": "Copper, PEX, ABS",
      "heating": "Radiant",
      "fuel_type": "Electric",
      "water_heater": "80 +/- gl Electric",
      "cooling": "Ductless mini split",
      "room_count": "6",
      "num_beds": "3",
      "room_total": "6",
      "main_lvl_area": "1060",
      "second_lvl_area": "440",
      "third_lvl_area": "",
      "gla": "1500 SqFt",
      "subject_age": "14+/-yrs",
      "num_baths": "2:1",
      "condition": "Average"
    },
    "comps": [
      {
        "distance_to_subject": "3.73 KM",
        "prop_type": "Detached",
        "stories": "1 Storey",
        "address": "64 Deermist Dr",
        "city_province": "Porters Lake NS B3E 1P3",
        "sale_date": "Jan/16/2025",
        "sale_price": "800,000",
        "dom": "141+/-",
        "location_similarity": "Inferior",
        "lot_size": "80212+/-SqFt",
        "age": "11+/-",
        "condition": "Similar",
        "gla": "1602+/-SqFt",
        "room_count": "6",
        "bed_count": "3",
        "bath_count": "2:0",
        "basement_finish": "Full/Finished",
        "parking": "Dbl. Att. Gar.",
        "neighborhood": ""
      },
      {
        "distance_to_subject": "8.98 KM",
        "prop_type": "Detached",
        "stories": "1 Storey",
        "address": "85 Oceanic Dr",
        "city_province": "East Lawrencetown NS B2Z 1T6",
        "sale_date": "Dec/21/2024",
        "sale_price": "950,000",
        "dom": "280+/-",
        "location_similarity": "Inferior",
        "lot_size": "61700+/-SqFt",
        "age": "11+/-",
        "condition": "Good",
        "gla": "2100+/-SqFt",
        "room_count": "6",
        "bed_count": "3",
        "bath_count": "2:0",
        "basement_finish": "Full/Finished",
        "parking": "1.5Att.Gar./Dbl.Att.Gar.",
        "neighborhood": ""
      },
      {
        "distance_to_subject": "17.33 KM",
        "prop_type": "Detached",
        "stories": "1.5 Storey",
        "address": "270 Quinlan Dr",
        "city_province": "Head of Jeddore NS B0J 1P0",
        "sale_date": "Nov/23/2024",
        "sale_price": "829,900",
        "dom": "47+/-",
        "location_similarity": "Similar",
        "lot_size": "48200+/-SqFt",
        "age": "12+/-",
        "condition": "Good",
        "gla": "1662+/-SqFt",
        "room_count": "5",
        "bed_count": "2",
        "bath_count": "2:0",
        "basement_finish": "Full/Part Finished",
        "parking": "Driveway",
        "neighborhood": ""
      }
    ],
    "properties": [
      {
        "id": 297301,
        "address": "638 Myers Point Road",
        "bedrooms": 2,
        "gla": 1136,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1P0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 2,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 65340.0,
        "year_built": 2010,
        "roof": "Asphalt Shingle",
        "basement": "Full, Fully Developed, Walkout",
        "cooling": "Baseboard, Heat Pump, Fireplace, ETS (Elec Thermal Storage)",
        "heating": "Baseboard, Heat Pump, Fireplace, ETS (Elec Thermal Storage)",
        "close_price": 710000.0,
        "close_date": "2024-10-30",
        "public_remarks": "Welcome to your dream home.  It boasts a prime waterfront location, offering stunning views of the water and direct access for recreational activities.  The main level lay out features an open concept design, creating a seamless flow between the living, dining and kitchen areas.  It maximizes space and allows for plenty of natural light, enhancing the airy and spacious feel of the home.  The kitchen has that touch of elegance and sophistication with its cherrywood cabinets offering both beauty and functionality.  The main living area offers panoramic views of the waterfront creating a tranquil environment.  It includes a cozy propane fireplace, ideal for the cooler evenings.  An expansive wrap around patio provides ample space for outdoor entertainment, relaxation and enjoying the scenic surroundings.  The primary bedroom with its own patio door to the patio and a large bathroom complete the main level.  The lower level features a spacious family room also with its own patio door, a bedroom, a den, another full bathroom and the laundry room.  The large detached garage provides the flexibility to be used as a workshop or hobby space.",
        "latitude": 44.7765,
        "longitude": -63.0424
      },
      {
        "id": 292631,
        "address": "281 West Jeddore Road",
        "bedrooms": 3,
        "gla": 1026,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1P0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow, 1 Level",
        "levels": "Bungalow, 1 Level",
        "room_count": 7,
        "full_baths": 1,
        "half_baths": 1,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 43560.0,
        "year_built": null,
        "roof": "Asphalt Shingle",
        "basement": "Undeveloped, Full, Walkout",
        "cooling": "Stove, Heat Pump, Ductless Cooling",
        "heating": "Stove, Heat Pump, Ductless Cooling",
        "close_price": 450000.0,
        "close_date": "2024-11-01",
        "public_remarks": "Welcome to 281 West Jeddore Rd., an oceanfront retreat in the scenic community West Jeddore, NS! This nicely renovated 3-bedroom, 1.5-bathroom home is move-in ready and offers a bright, open-concept layout perfect for modern living. Enjoy the convenience of main-floor laundry and one level living. Set on calm cove waters, this property boasts deep anchorage with a private wharf, making it ideal for boating, fishing, paddle boarding and all other waterfront enjoyment. The outdoor space is perfect for entertaining with a charming gazebo offering stunning panoramic water views. Located just 35 minutes from Dartmouth, this home is close to all the amenities you need, included great schools, a hospital, and a rink. Weather you're looking for a year-round home or a peaceful getaway, this oceanfront gem has it all!",
        "latitude": 44.7683,
        "longitude": -63.0714
      },
      {
        "id": 297309,
        "address": "46 Ostrea Lake Road",
        "bedrooms": 3,
        "gla": 2117,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow, 2 Level",
        "levels": "Bungalow, 2 Level",
        "room_count": 13,
        "full_baths": 1,
        "half_baths": 1,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 99929.0,
        "year_built": 1967,
        "roof": "Asphalt Shingle",
        "basement": "Partially Developed",
        "cooling": "Baseboard, Heat Pump, Fireplace",
        "heating": "Baseboard, Heat Pump, Fireplace",
        "close_price": 930000.0,
        "close_date": "2024-11-01",
        "public_remarks": "For an in-depth look, see it at Realtor.ca and click “More Information” to access much more detail including the feature video and galleries for “Interior”, “Exterior” and “Seasonal” shots! Are you looking for your own sandy beach, dock, wharf, and a boat launch on over two acres of protected oceanfront? Are you looking to have all your bedrooms and bathrooms on the main level, in move-in ready condition? Now's your opportunity to live the Nova Scotia dream! Welcome to 46 Ostrea Lake Road, a stunning luxury oceanfront property in Musquodoboit Harbour. This elegant ranch-style home is set on nearly 100,000 square feet with 320 feet of oceanfront. This includes a separate lot with potential for another home with access to the ocean. You can kayak, paddleboard, boat or fish off the dock in the summer and even icefish in the winter in this calm inlet. Aside from the double garage, this home also features multiple outbuildings to store boats, equipment, and any other toys you may have. This heavily renovated home has had nearly everything redone in the last 15 years and all the details have been meticulously chosen. It’s 2565 SF total, with the main floor being 2117 SF. Central to this home is a chef’s kitchen with stainless steel appliances, high-quality cupboards and a Zodiak quartz counter top. The home features a large primary bedroom with a walk-in closet and two other roomy bedrooms for family or guests. It also features a large full bathroom with granite countertops, dual-person air tub, and a separate walk-in shower. Down the hall is a convenient half bathroom for guests. The home is heated and cooled with a fully ducted heat pump system in addition to a mini-split heat pump for even greater efficiency and equipped with sophisticated video and infrared security systems to ensure safety and convenience. Experience serene luxury at 46 Ostrea Lake Road, where every sunset promises another peaceful day. This is more than a home; it's a lifestyle waiting for you.",
        "latitude": 44.7809,
        "longitude": -63.1032
      },
      {
        "id": 293953,
        "address": "15 Macdonald Lane",
        "bedrooms": 2,
        "gla": 816,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 3,
        "full_baths": 1,
        "half_baths": 1,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 89298.0,
        "year_built": 2021,
        "roof": "Asphalt Shingle",
        "basement": "None",
        "cooling": "Baseboard",
        "heating": "Baseboard",
        "close_price": 430000.0,
        "close_date": "2024-11-08",
        "public_remarks": "Seize the opportunity to own a slice of serenity at 15 MacDonald Lane, Musquodoboit Harbour. This 2-bed, 1.5-bath haven welcomes you with an open concept, featuring wooden ceilings and a striking vaulted ceiling in the living room, dining area, and kitchen. Electric baseboard heating ensures your comfort year-round. What truly sets this property apart? Picture waking up to the tranquil sounds of the bay right at your doorstep. Imagine sipping your morning coffee while the bay whispers its secrets. Whether you crave a year-round residence or a secret escape, this property is your canvas for crafting unforgettable moments. Don't just own a home; embrace the coastal lifestyle that awaits.",
        "latitude": 44.7889,
        "longitude": -63.1428
      },
      {
        "id": 293612,
        "address": "8426 Highway 7",
        "bedrooms": 3,
        "gla": 1350,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "2 Level",
        "levels": "2 Level",
        "room_count": 7,
        "full_baths": 1,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 30719.0,
        "year_built": 1918,
        "roof": "Metal",
        "basement": "Undeveloped, Full, Walkout",
        "cooling": "Forced Air",
        "heating": "Forced Air",
        "close_price": 395000.0,
        "close_date": "2024-11-28",
        "public_remarks": "Nestled in peaceful Musquodoboit Harbour, this charming 3-bedroom, 1-bath home is bursting with character. The main living areas are filled with natural light creating a warm and inviting atmosphere throughout, complimented by original hardwood floors and wood trim. The living room and dining room flow seamlessly, making it an ideal space for entertaining. All three bedrooms are comfortable, with lots of closet space, and a claw foot tub will welcome you into the upstairs bathroom. Outside, the property is a true standout. A mature chestnut tree provides both shade and a functioning chicken coop for those looking to embrace a more sufficient lifestyle. Whether you have a green thumb or just enjoy outdoor space, the large lot offers ample room for gardening, recreation, or future expansion.",
        "latitude": 44.7903,
        "longitude": -63.1199
      },
      {
        "id": 294897,
        "address": "569 West Jeddore Road",
        "bedrooms": 3,
        "gla": 1320,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1P0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 4,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 92347.0,
        "year_built": 2013,
        "roof": "Asphalt Shingle",
        "basement": "Undeveloped, Walkout",
        "cooling": "Baseboard, Heat Pump",
        "heating": "Baseboard, Heat Pump",
        "close_price": 378275.0,
        "close_date": "2024-12-06",
        "public_remarks": "This thoughtfully designed bungalow features a spacious layout with cathedral ceilings, an eat-in kitchen, oak cabinets, and a large island. Patio doors off the dining area lead to a deck offering breathtaking views of Jeddore Harbour, where you can enjoy spectacular sunrises. The main floor offers three bedrooms, including a primary suite with an ensuite and double closets, and a second full bathroom. With laminate floors throughout and main-floor laundry, with minimal modifications, this home is perfect for accessible living. The unfinished basement, complete with a walkout, provides a blank canvas for creating a secondary suite or expanding your living space. Set along a scenic seaside road, the property is close to Clam Harbour, Martinique Beach, and the Greenway walking trail. The community offers amenities such as a grocery store, pub, spa, bakery, and more, while still being just over 30 minutes from the city.",
        "latitude": 44.7584,
        "longitude": -63.0603
      },
      {
        "id": 293390,
        "address": "9051 Highway 7",
        "bedrooms": 3,
        "gla": 1092,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1P0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Split Entry",
        "levels": "Split Entry",
        "room_count": 14,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 29832.0,
        "year_built": 1995,
        "roof": "Asphalt Shingle",
        "basement": "Full, Partially Developed, Walkout",
        "cooling": "Baseboard, Furnace, Forced Air",
        "heating": "Baseboard, Furnace, Forced Air",
        "close_price": 415000.0,
        "close_date": "2024-12-09",
        "public_remarks": "This charming split-entry home offers a perfect blend of comfort, convenience, and potential, ideal for families or those looking to expand. Located just a short walk from local convenience stores, this home boasts a spacious layout with thoughtful features throughout. New back roof shingles and front siding 2023.  New spray foam insulation in the attic 2024. It Includes a master bedroom with ensuite, providing privacy and convenience. Two additional well-sized bedrooms on the main level offer flexibility for family, guests, or home office needs. The partially finished basement offers the exciting opportunity to add a fourth bedroom, allowing you to customize the space to your needs.The lower level features a generously sized family room, perfect for entertaining, movie nights, or creating a cozy retreat.  Step outside onto the large deck, which extends the living space and is perfect for barbecues, relaxation, or enjoying your morning coffee.  The private backyard provides a serene retreat, complete with a fire pit that’s perfect for gatherings and outdoor enjoyment all year round.  Equipped with solar panels, this home not only helps reduce energy costs but also promotes sustainability.",
        "latitude": 44.7788,
        "longitude": -63.0876
      },
      {
        "id": 292232,
        "address": "6547 Highway 7",
        "bedrooms": 3,
        "gla": 1100,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0H 1N0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "2 Level",
        "levels": "2 Level",
        "room_count": 7,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 21446.0,
        "year_built": 1945,
        "roof": "Metal",
        "basement": "Crawl Space",
        "cooling": "Furnace, Forced Air",
        "heating": "Furnace, Forced Air",
        "close_price": 420000.0,
        "close_date": "2024-12-13",
        "public_remarks": "Welcome to your dream home! This beautifully renovated 3-bedroom, 2-bathroom residence is ideally situated just minutes from Dartmouth and the amenities of Porters Lake. Featuring a functional layout with the primary bedroom and laundry conveniently located on the main floor. The extensive updates cannot be ignored including brand new windows that fill the space with natural light, a durable metal roof, and stylish siding. The electrical and plumbing systems have been completely updated, ensuring peace of mind for years to come. Enjoy cooking and entertaining in the custom kitchen, which boasts elegant finishes and ample storage space. Both bathrooms have been tastefully updated, contributing to the home's modern appeal. The new furnace and hot water heater guarantee efficiency and comfort year-round.Outside, you’ll find a private backyard oasis – an ideal spot for relaxing, gardening, or entertaining friends and family. That’s not all! You’re just 15-20 minutes from stunning beaches and have direct access to the Trans Canada Trail right across the road, perfect for outdoor enthusiasts.Don’t miss out on this amazing opportunity to own a meticulously renovated home in a prime location. Schedule your viewing today and fall in love with all this community has to offer.",
        "latitude": 44.7648,
        "longitude": -63.2169
      },
      {
        "id": 292152,
        "address": "8179 7 Highway",
        "bedrooms": 2,
        "gla": 1078,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "1.5 Level",
        "levels": "1.5 Level",
        "room_count": 7,
        "full_baths": 1,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 32400.0,
        "year_built": null,
        "roof": "Asphalt Shingle",
        "basement": "None",
        "cooling": "Baseboard, Heat Pump",
        "heating": "Baseboard, Heat Pump",
        "close_price": 325000.0,
        "close_date": "2024-12-27",
        "public_remarks": "Spend the holidays in your new home! A quick closing is available on this charming one-and-a-half-story home in Musquodoboit Harbour perfectly combines modern finishes with coastal charm. Recently renovated, the home features an eat-in kitchen with white shaker cabinets, a stylish tile backsplash, and brushed gold hardware. The mudroom offers ample storage for outerwear and footwear, while the main floor laundry adds convenience. Upstairs, you’ll find two generously sized bedrooms, one offering serene harbour views, and a beautifully updated bathroom with a tiled tub enclosure. The partially fenced yard provides privacy and safety, while the garden shed offers additional outdoor storage. Situated close to beaches, walking trails, and local amenities, this home is just 30 minutes from the city. Whether you’re seeking a peaceful retreat or a home with easy access to urban conveniences, this property offers the best of both worlds.",
        "latitude": 44.7922,
        "longitude": -63.1337
      },
      {
        "id": 263677,
        "address": "205 East Petpeswick Road, Musquodoboit Harbour",
        "bedrooms": 2,
        "gla": 616,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Detached",
        "style": "Detached",
        "levels": "Detached",
        "room_count": 4,
        "full_baths": 1,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 34000.0,
        "year_built": 1934,
        "roof": "Asphalt Shingle",
        "basement": "None",
        "cooling": "Furnace",
        "heating": "Furnace",
        "close_price": 135000.0,
        "close_date": "2025-01-10",
        "public_remarks": "Welcome to the Cottage. Perfectly located just 1/2 hour from Dartmouth and 10 minutes from the famous Martinique Beach. All your local conveniences are a 2 minutes drive away in Musquodoboit Harbour, there's even a Tims for that morning coffee fix. Enjoy the breathtaking view of the Ocean from your front porch or rear deck while sipping on your favorite beverage. The 3 season cottage has received many upgrades including landscaping, interior and exterior painting, some newer windows, newer drainage system, newer incinerator toilet, plumbing, electrical and more. Bring your fishing pole, kayak, surf board and hiking boots to enjoy all that the Eastern Shore has to offer. Spend a day checking out he surf at Martinique Beach or go for a hike on the nearby Trans Canada Trails. Book your showing Today.",
        "latitude": 44.7784,
        "longitude": -63.1482
      },
      {
        "id": 295026,
        "address": "2 Willowdale Drive",
        "bedrooms": 3,
        "gla": 1182,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Side Split, 3 Level",
        "levels": "Side Split, 3 Level",
        "room_count": 10,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 32393.0,
        "year_built": 1998,
        "roof": "Asphalt Shingle",
        "basement": "Crawl Space, Fully Developed",
        "cooling": "Forced Air, Fireplace, In Floor",
        "heating": "Forced Air, Fireplace, In Floor",
        "close_price": 500000.0,
        "close_date": "2025-02-06",
        "public_remarks": "Nestled in the heart of Musquodoboit Harbour, this delightful 3-bedroom, 2-bathroom home offers a perfect blend of comfort and convenience. Situated on a private lot, this property provides ample space for relaxation and outdoor activities while being just minutes from Highway 107, ensuring an easy commute to nearby amenities.  The home features a practical three-level side split design, providing distinct living spaces that cater to both family living and entertaining. The bright and airy main floor boasts a welcoming living area, while the lower level offers additional space for a family room or home office.  For those who love their vehicles or need extra storage, the detached two-car garage is a standout feature. Whether you’re looking for a workshop or space to store your recreational equipment, this garage delivers both functionality and flexibility.  With its desirable location, private setting, and thoughtful layout, 2 Willowdale Drive is a must-see for anyone looking to embrace the serene lifestyle of Musquodoboit Harbour.",
        "latitude": 44.7832,
        "longitude": -63.1657
      },
      {
        "id": 294018,
        "address": "6820 Highway 7",
        "bedrooms": 3,
        "gla": 900,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0H 1N0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 12,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 17238.0,
        "year_built": 1980,
        "roof": "Asphalt Shingle",
        "basement": "Full, Fully Developed, Walkout",
        "cooling": "Stove, Heat Pump",
        "heating": "Stove, Heat Pump",
        "close_price": 500000.0,
        "close_date": "2025-03-21",
        "public_remarks": "Welcome to 6820 Highway 7 in Gaetz Brook - a quaint community only 30 minutes to Dartmouth and Halifax close to water and walking/running trails - perfect for outdoor enthusiasts! This home has been meticulously cared for since being purchased in 2022 and features substantial upgrades including a new septic system, well pump, gutters, water heater, all new fixtures, and flooring - be sure to ask your realtor for the complete list to capture the work completed in this home! Situated on a generously sized lot, this home features 2 bedrooms on the main level, a 4 PC bath, and an open-concept living and dining room area. Downstairs there is a rec room with ample space for activities, featuring a pellet stove (great for additional heating), a primary bedroom, an office, and another 4 PC bathroom. With a deck, fenced yard, shed, attached single car garage and a screened in porch area that is perfect for morning coffee or relaxing with a book, this home is a perfect option for anyone who wants solitude, to be close to nature, yet close enough to be in the city with a short commute. Book your showing today!",
        "latitude": 44.7747,
        "longitude": -63.2075
      },
      {
        "id": 299237,
        "address": "425 Highway 357",
        "bedrooms": 1,
        "gla": 320,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1N0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "1.5 Level",
        "levels": "1.5 Level",
        "room_count": 3,
        "full_baths": 1,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 74381.0,
        "year_built": 1875,
        "roof": "Asphalt Shingle",
        "basement": "None",
        "cooling": "Forced Air",
        "heating": "Forced Air",
        "close_price": 108000.0,
        "close_date": "2025-04-02",
        "public_remarks": "Welcome to 425 Highway 357, a unique 2-lot package offering 1.7 ACRES of breathtaking riverfront views and peaceful surroundings.   Cherished by the same family for generations, this homestead presents a rare opportunity for its next owners to create something truly special. The property includes a 1-bedroom with the option to convert into a  2-bedroom home with endless possibilities. Whether you choose to fix it up and live in it or build your dream home on the hillside, the home holds great potential This property is an excellent candidate for rental or Airbnb opportunities, It has functioning well and septic system is already in place.   Directly across the road lies the inclusion of a beautiful riverfront lot used for recreational purposes. The lot boasts excellent fishing opportunities, with salmon pools surrounding the island and river. The expansive land offers ample space to build your dream home, surrounded by incredible wildlife and serene natural beauty. Nature lovers will be captivated by the abundant wildlife and bird species that frequent the river and hills surrounding the property. The river itself is perfect for outdoor activities such as fishing, canoeing, and kayaking. Conveniently located, the property is close to all essential and major amenities as well as the Musquodoboit hiking trail system, which features 41 km of scenic trails.   Whether you're looking to build your dream home or take advantage of the existing dwelling, this property offers it all. Book your viewing today! Don't miss out on this unique opportunity!",
        "latitude": 44.8016,
        "longitude": -63.1651
      },
      {
        "id": 293449,
        "address": "9559 Highway 7",
        "bedrooms": 2,
        "gla": 1130,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1P0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "1.5 Level",
        "levels": "1.5 Level",
        "room_count": 5,
        "full_baths": 1,
        "half_baths": 2,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 35810.0,
        "year_built": 1950,
        "roof": "Asphalt Shingle",
        "basement": "Partially Developed, Walkout",
        "cooling": "Baseboard, Forced Air",
        "heating": "Baseboard, Forced Air",
        "close_price": 285000.0,
        "close_date": "2025-04-04",
        "public_remarks": "Welcome to this cozy and inviting 2-bedroom, 1.5 bathroom home, the perfect opportunity for first-time homebuyers looking to make their mark. Nestled in with gorgeous ocean views, this property offers a unique blend of comfort and potential. Inside you will find a warm and functional layout, with a spacious living area, a lovely view in the kitchen, and a convenient half bath with laundry for guests. The unfinished basement presents a fantastic opportunity to expand the living space. It can be transformed into a small apartment or in-law suite – ideal for extra income or accommodating family members. Outside, enjoy the fresh ocean air and sweeping views, making this home not just a place to live, but a lifestyle to embrace. Don't miss the chance to own this wonderful home with incredible potential!",
        "latitude": 44.7778,
        "longitude": -63.0583
      },
      {
        "id": 299502,
        "address": "Lot 1 Highway 357",
        "bedrooms": 2,
        "gla": 1185,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 3,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 43560.0,
        "year_built": null,
        "roof": "Metal",
        "basement": "None",
        "cooling": "Baseboard, Heat Pump",
        "heating": "Baseboard, Heat Pump",
        "close_price": 420000.0,
        "close_date": "2025-04-08",
        "public_remarks": "New construction!  This two bed, two bath with attached garage has a great functional layout and is in a perfect location.  It's an easy commute to town from here or an ideal setup to work from home with fiber Op available.  This property is currently being subdivided so take your pick of which lot you want.",
        "latitude": 44.7873,
        "longitude": -63.1481
      },
      {
        "id": 298924,
        "address": "8210 Highway 7",
        "bedrooms": 2,
        "gla": 440,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "1.5 Level",
        "levels": "1.5 Level",
        "room_count": 3,
        "full_baths": 1,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 43560.0,
        "year_built": null,
        "roof": "Asphalt Shingle",
        "basement": "Undeveloped, Crawl Space",
        "cooling": "None",
        "heating": "None",
        "close_price": 263500.0,
        "close_date": "2025-04-14",
        "public_remarks": "Paradise waiting for your finishing touches.  With 350 feet of serene river frontage you can enjoy boating and kayaking from your backyard with easy access to the ocean. The home requires finishing, new electrical is in place, new drilled well, new septic, new roof, new deck, partially new cedared exterior and a new French drain.  With MU zoning, this property offers endless possibilities, including business usage, ample parking with valuable main road exposure. Clam Harbour Beach Provincial Park just 15 minutes away, Martinique Beach within 25 minutes, and Dartmouth just a 30-minute drive.",
        "latitude": 44.7919,
        "longitude": -63.1318
      },
      {
        "id": 299717,
        "address": "215 Scotsdale Drive",
        "bedrooms": 5,
        "gla": 3675,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 1N0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "2 Level",
        "levels": "2 Level",
        "room_count": 16,
        "full_baths": 4,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 110868.0,
        "year_built": 2004,
        "roof": "Asphalt Shingle",
        "basement": "Full, Fully Developed",
        "cooling": "Baseboard",
        "heating": "Baseboard",
        "close_price": 999999.0,
        "close_date": "2025-04-24",
        "public_remarks": "Welcome to 215 Scotsdale Drive, Musquodoboit, NS.  This Architecturally designed custom lakefront home on a massive, private 2.6 acre lot, has all that you are looking for. House features 5 large bedrooms, 4 full bathrooms, 20ft ceiling great room, theatre room, massive open basement rec room with walkout, hardwood floors, open kitchen/dining/living area, mudroom off attached dbl garage. Plenty of parking on the large, newly paved, crescent driveway, tree lined private lot, features man made pond, cleared areas with loads of potential, waterfront dock to Scott’s Lake (power boat friendly). This is truly a rare opportunity short drive to Musquodoboit or Porters Lake amenities and only 30 mins to Dartmouth. Call your agent and book a showing. Check out listing video and iGuide for more info.",
        "latitude": 44.787,
        "longitude": -63.1852
      },
      {
        "id": 299230,
        "address": "Unit 7  East Petpeswick Road",
        "bedrooms": 3,
        "gla": 1472,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Detached",
        "structure_type": "Single Family",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 3,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 126952.0,
        "year_built": null,
        "roof": "Asphalt Shingle",
        "basement": "None",
        "cooling": "Baseboard, Heat Pump",
        "heating": "Baseboard, Heat Pump",
        "close_price": 545000.0,
        "close_date": "2025-05-02",
        "public_remarks": "This home is ideal one level living. Walk in to a tiled foyer, where all the muddy boots can live. The vaulted tongue and groove pine ceiling immediately catches your attention and creates a wonderfully warm space. With an open concept living, dining and kitchen area, there is plenty of room to entertain. A hallway leads to the 3 bedrooms, complete with a 4 piece bathroom and full ensuite bathroom off the primary bedroom. Enjoy custom cabinetry and stone countertops throughout! Efficiently heated with a ductless heat pump, and nestled on a private lot, this is a dreamy bungalow in the woods.",
        "latitude": 44.7865,
        "longitude": -63.1475
      },
      {
        "id": 300744,
        "address": "8683 Highway 7",
        "bedrooms": 4,
        "gla": 1152,
        "city": "Nova Scotia",
        "province": "Nova Scotia",
        "postal_code": "B0J 2L0",
        "property_sub_type": "Over-Under",
        "structure_type": "Duplex",
        "style": "Bungalow",
        "levels": "Bungalow",
        "room_count": 8,
        "full_baths": 2,
        "half_baths": 0,
        "main_level_finished_area": null,
        "upper_lvl_fin_area": null,
        "bg_fin_area": null,
        "lot_size_sf": 52272.0,
        "year_built": 1991,
        "roof": "Metal",
        "basement": "Full, Fully Developed, Walkout",
        "cooling": "Baseboard",
        "heating": "Baseboard",
        "close_price": null,
        "close_date": "2025-05-13",
        "public_remarks": "A great opportunity to build equity in this cozy home in a quiet family friendly neighbourhood. This 3 bedroom is a charmer,  with cathedral ceilings, rustic farmhouse feel and tonnes of character. It's tucked back off the road and on over an acre of private land with distant water views. With some TLC the secondary suite on the lower level would be perfect for extra income or for extended family. Lots of room to add a garage.  Recent improvements include steel roof, oil tank, water purification system. This property is Being sold as is where is, and is waiting for its next owners to bring the shine back to this gem.",
        "latitude": 44.7882,
        "longitude": -63.1068
      }
    ]
}